package com.rd.define;

/**
 * Created by XingYun on 2016/5/19.
 */
public class TextDefine {

    public static final String[] SURNAMES = {"安陵", "白", "百里", "柏", "柏侯", "包", "鲍", "北宫", "北山", "北唐", "毕", "卜",
            "蔡", "曹", "岑", "常", "车", "陈", "程", "仇", "崔", "澹台", "邓", "狄", "第五", "丁", "东方", "东郭", "东门", "董", "窦", "独孤",
            "端木", "段", "樊", "范", "方", "房", "费", "封", "冯", "符", "傅", "高", "公门", "公孙", "公羊", "公冶", "宫", "龚", "顾", "管",
            "韩", "郝", "何", "贺", "赫连", "洪", "侯", "呼延", "华", "皇甫", "惠", "霍", "吉", "即墨", "纪", "贾", "江", "姜", "蒋", "解", "经",
            "景", "柯", "孔", "雷", "黎", "李", "连", "廉", "粱", "凌", "令狐", "刘", "柳", "卢", "鲁", "陆", "罗", "骆", "吕", "马", "孟", "苗",
            "闵", "莫", "牧", "慕容", "穆", "南宫", "聂", "宁", "欧阳", "潘", "庞", "裴", "彭", "亓官", "齐", "祁", "钱", "乔", "秦", "邱", "秋",
            "裘", "任", "荣", "阮", "上官", "邵", "申屠", "沈", "施", "石", "史", "司空", "司寇", "司马", "司徒", "宋", "苏", "孙", "太史", "汤",
            "唐", "陶", "田", "童", "拓跋", "万", "汪", "王", "韦", "卫", "尉迟", "魏", "温", "闻人", "翁", "巫", "吴", "伍", "武", "西门", "席",
            "夏", "夏侯", "鲜于", "向", "项", "萧", "谢", "邢", "徐", "许", "轩辕", "薛", "荀", "严", "阎", "颜", "燕", "杨", "姚", "叶", "尹",
            "应", "尤", "于", "余", "俞", "虞", "宇文", "元", "袁", "翟", "詹", "张", "章", "长孙", "赵", "甄", "郑", "钟离", "周", "朱", "诸葛",
            "卓", "子书", "邹", "祖", "左"};

    public static final String[] MALENAMES = {"傲天", "百川", "半雪", "薄云", "碧空", "别鹤", "伯光", "伯乾", "伯云", "博文", "博云", "搏云", "不凡", "不言",
            "不语", "沧海", "辰逸", "成风", "成云", "乘风", "乘云", "冲虚", "仇天", "酬海", "处机", "传宗", "吹雪", "春秋", "道天", "顶天", "定江", "东白", "动流", "断秋",
            "断天", "飞阁", "非笑", "风华", "风云", "枫竹", "峰穹", "复天", "孤风", "谷雪", "光豪", "广陵", "归农", "归真", "过云", "寒枫", "寒松", "行空", "豪英", "昊强",
            "昊天", "浩澜", "浩南", "浩天", "浩宇", "皓岚", "皓天", "皓轩", "鹤轩", "痕沙", "恒天", "弘文", "红血", "花雨", "华隆", "辉耀", "家洛", "嘉懿", "简斋", "剑愁",
            "剑风", "剑峰", "剑清", "剑通", "剑心", "剑影", "瑾瑜", "进博", "晋鹏", "景岳", "敬侠", "靖仇", "靖琪", "靖易", "靖元", "九霄", "君浩", "俊楠", "峻熙", "骏雄",
            "开山", "开天", "开宇", "空空", "黎昕", "连碧", "连虎", "灵竹", "留香", "龙耀", "鹭洋", "洛书", "梦白", "觅云", "灭龙", "明辉", "明轩", "冥幽", "铭魂", "牧云",
            "慕白", "南青", "南松", "南天", "破敌", "破天", "绮凡", "千酬", "千秋", "青寒", "青侯", "青书", "青桐", "青雄", "清泉", "清扬", "清云", "擎苍", "擎宇", "秋白",
            "秋魂", "人杰", "睿渊", "若风", "若剑", "三少", "三问", "三笑", "善均", "善朋", "绍辉", "神通", "声谷", "晟睿", "士萧", "士霄", "世倌", "世魁", "世平", "世章",
            "水云", "司朋", "思归", "思豪", "松风", "松年", "松溪", "太冲", "天保", "天丞", "天川", "天德", "天风", "天恒", "天宏", "天磊", "天禄", "天奇", "天寿", "天抒",
            "天问", "天星", "铁心", "图南", "万仇", "万里", "万天", "万亭", "忘忧", "惟忠", "维侠", "伟祺", "伟泽", "温侯", "文博", "文冲", "文昊", "文龙", "问天", "我行",
            "无敌", "无极", "无忌", "无剑", "无缺", "无施", "无血", "小凡", "小邪", "小鱼", "晓风", "笑白", "笑天", "信凌", "星武", "修杰", "旭尧", "玄风", "玄天", "寻欢",
            "烟客", "延豹", "延龙", "延庆", "炎彬", "炎武", "遥心", "野牧", "烨磊", "一刀", "一雷", "一鸣", "一笑", "毅山", "懿轩", "迎松", "幼南", "雨泽", "元霸", "元鹤",
            "元龙", "远峰", "远锋", "远玄", "苑博", "越彬", "越泽", "云奇", "云翼", "泽洋", "长青", "召重", "兆和", "哲瀚", "正德", "志平", "致远", "中则", "仲英", "追命",
            "子轩", "子云", "紫霄", "道之", "万声", "疾", "隶", "败", "三德", "人达", "剑心", "万天", "威", "沅", "悲", "一德", "人英", "剑成", "祥", "翎", "羿",
            "老九", "人杰", "剑封", "绝山", "誉", "戎", "储", "老五", "人雄", "万言", "绝义", "枫", "擎", "靳", "老四", "元龙", "绝悟", "沧海", "凛", "荆", "汲", "十三",
            "成威", "绝施", "万仇", "涛", "丑", "邴", "如豹", "成协", "乘风", "万怨", "卿", "坤", "糜", "连虎", "不评", "乘云", "万恶", "豁", "耷", "松", "似狮", "老三",
            "世开", "恶天", "焱", "磬", "井", "大楚", "广山", "剑鬼", "灭龙", "虔", "函", "富", "定帮", "不言", "远锋", "剑身", "契", "翰", "乌", "伟帮", "追命", "远望",
            "无敌", "罡", "遥", "焦", "大有", "难敌", "远山", "半鬼", "鸿", "萧", "奎", "高烽", "难破", "广缘", "行天", "胜", "嚣", "稀", "自中", "难摧", "天与", "浩天",
            "鹰", "骁", "班", "天川", "难胜", "天抒", "天寿", "卿", "鲂", "仰", "大开", "德地", "天奇", "无血", "城", "剑", "伊", "傀儡", "德天", "半仙", "聋五", "康",
            "筮", "栾", "羊青", "世平", "一鸣", "如花", "阁", "勒", "厉", "牛青", "世德", "文龙", "三问", "穆", "炳", "戎", "开山", "世立", "元正", "非笑", "扬", "斩",
            "天德", "中恶", "浩阑", "蓝血", "垣", "颤", "铁身", "延恶", "士晋", "无招", "师", "孱", "老黑", "百川", "铸海", "无极", "翼", "续", "半邪", "世倌", "人龙",
            "鬼神", "秋", "岩", "半山", "连碧", "伯云", "满天", "傥", "奄", "一江", "岱周", "老头", "飞扬", "乞", "箴", "十八", "行恶", "剑通", "行恶", "剑通", "致远",
            "俊驰", "雨泽", "烨磊", "晟睿", "天佑", "文昊", "修洁", "黎昕", "远航", "旭尧", "鸿涛", "伟祺", "荣轩", "越泽", "浩宇", "瑾瑜", "皓轩", "擎苍", "擎宇",
            "志泽", "子轩", "睿渊", "弘文", "哲瀚", "雨泽", "博超"};

    public static final String[] FEMALNAMES = {"傲晴", "傲珊", "闭月", "碧彤", "冰洁", "冰旋", "冰颜", "不二", "不悔", "不乐", "涔雨", "嫦曦", "朝雪",
            "沉鱼", "萃愁", "翠锦", "丹妗", "淡烟", "尔岚", "凡英", "梵音", "芳茵", "飞飞", "飞凤", "非烟", "菲青", "菲音", "凤凰",
            "凤灵", "凤翎", "芙碧", "芙蓉", "孤烟", "孤雁", "莞冉", "涫涫", "寒云", "红棉", "红袖", "欢馨", "幻然", "幻雪", "幻嫣", "荟闲",
            "惠茜", "惠心", "佳琦", "蛟凤", "婕珍", "瑾萱", "璟雯", "婧琪", "靖瑶", "静宸", "静琪", "静香", "静璇", "九真", "绝音", "珺瑶",
            "可馨", "可秀", "兰若", "阑香", "阑悦", "蓝翎", "乐菱", "乐姗", "黎云", "莉姿", "怜梦", "琳琼", "灵儿", "灵煌", "灵珊", "灵素", "灵芸",
            "玲珑", "凌菲", "凌薇", "翎雪", "绫栾", "曼玉", "美萱", "媚颜", "梦洁", "梦璐", "梦琪", "梦清", "梦瑶", "妙芹", "妙彤", "敏颖", "明梅",
            "鸣凤", "茗茗", "茗玉", "冥茗", "莫言", "沐卉", "慕灵", "慕青", "沛菡", "沛玲", "沛珊", "萍影", "淇倩", "琪涵", "琦巧", "绮罗", "倩如",
            "倩雪", "芹雁", "青荷", "青莲", "青青", "青婴", "青竹", "清涟", "清颜", "蓉茜", "柔心", "如冰", "如娆", "如萱", "如雪", "如音", "茹雪", "茹嫣",
            "睿婕", "若冰", "若兰", "若兮", "若颜", "桑榆", "衫盈", "珊珊", "珊菀", "善斓", "善若", "笙馨", "诗琪", "诗茵", "姝烟", "淑颖", "双双", "双英",
            "姒香", "素阴", "素影", "太清", "太英", "檀雅", "婷冉", "彤倩", "桐竹", "宛儿", "菀柳", "惋清", "婉婷", "绾绾", "唯雪", "文馨", "文秀", "雯青",
            "问晴", "溪灵", "熙雯", "香寒", "香茹", "香怡", "香雨", "湘颜", "襄馨", "向珊", "小仙", "小小", "晓芙", "晓亦", "笑怡", "心兰", "芯情", "欣妍",
            "新柔", "歆瑶", "馨蕊", "馨彤", "秀姝", "绣连", "雪慧", "雪雁", "血茗", "雅芙", "雅静", "雅琳", "亚男", "娅楠", "嫣媚", "嫣然", "妍思", "颜凤",
            "艳资", "雁姝", "妖妖", "夜阑", "夜蓉", "依娜", "怡香", "怡心", "以蕊", "易烟", "莺语", "瑛凝", "荧仙", "荧荧", "盈盈", "莹冰", "莹芝", "颖遥",
            "优璇", "佑怡", "羽馨", "雨寒", "雨嘉", "雨婷", "语兰", "语琴", "语蓉", "语嫣", "玉兰", "玉珍", "钰彤", "煜婷", "元霜", "沅芷", "月婵", "玥怡",
            "芸熙", "芸萱", "芸遥", "芸遥", "韵寒", "真真", "筝凡", "芷青", "芷若", "稚晴", "洙云", "珠妍", "姿倩", "紫翠", "紫寒",
            "紫霜", "紫烟", "紫伊", "紫衣", "醉蓝", "邑", "乾", "绯", "擎汉", "豪英", "剑愁", "一笑", "逊", "蹇", "涔", "酬海",
            "成败", "冥幽", "天问", "紊", "剑", "臻", "复天", "忘幽", "士萧", "山河", "凡", "鞯", "珩", "严青", "成危", "中道",
            "仇天", "嵩", "达", "鹤", "不斜", "成风", "道天", "一斩", "豪", "烙", "鞅", "不可", "成仁", "道消", "不二", "裘",
            "冥", "霸", "不正", "无施", "道罡", "无剑", "匪", "惮", "寇", "无声", "不斜", "不凡", "断天", "戾", "雍", "博",
            "百招", "靖仇", "不尤", "远侵", "瑛", "鑫", "匕", "千万", "若风", "千筹", "一刀", "铭", "靖", "弼", "随阴", "若剑",
            "断秋", "碧空", "霆", "紊", "碧", "一手", "若之", "断缘", "仇血", "驳", "钧", "捕", "三毒", "亿先", "子骞", "鹏涛",
            "炎彬", "鹤轩", "越彬", "风华", "靖琪", "明辉", "伟诚", "明轩", "健柏", "修杰", "志泽", "弘文", "峻熙", "嘉懿", "煜城",
            "懿轩", "烨伟", "苑博", "伟泽", "熠彤", "鸿煊", "博涛", "烨霖", "烨华", "煜祺", "智宸", "正豪", "明杰", "立诚", "立轩",
            "立辉", "峻熙", "弘文", "熠彤", "鸿煊", "烨霖", "鑫鹏", "天思", "聪展", "鹏笑", "愚志", "强炫", "明雪", "松思", "源智",
            "渊思", "晓啸", "天宇", "浩然", "文轩", "振家", "乐驹", "晓博", "文博", "昊焱", "立果", "金鑫", "锦程", "嘉熙", "鹏飞",
            "子默", "思远", "浩轩", "语堂", "聪健", "问旋", "白易", "问筠", "听白", "代桃", "冷之", "盼秋", "秋寒", "慕蕊", "海亦",
            "初晴", "盼旋", "幼旋", "尔蓝", "沛山", "代丝", "觅松", "夜白", "冷安", "醉薇", "凡梦", "尔曼", "念波", "问安", "雅阳",
            "友绿", "诗云", "飞风", "寄灵", "书芹", "访琴", "谷波", "妙海", "从安", "之玉", "雨珍", "冰安", "秋白", "南风", "醉山",
            "初彤", "凝海", "映波", "平文", "青文", "寻菡", "沛白", "平灵", "芷烟", "白易", "尔阳", "怜烟", "谷槐", "楷瑞", "建辉",
            "晋鹏", "天磊", "绍辉", "泽洋", "鑫磊", "鹏煊", "昊强", "伟宸"};

    public static final String[] RESERVED_WORDS = {",", "$", "'", " ", ";", "#", ":", "=", "\\", "\\x", "\""};

    public static final String YEAR = "年";
    public static final String MONTH = "月";
    public static final String DAY = "日";

    public static final String ARENA_MAIL_TITLE = "竞技场排名奖励";
    public static final String KILLER_MAIL_TITLE = "杀戮榜排名奖励";
    public static final String LEVEL_MAIL_TITLE = "等级榜排名奖励";
    public static final String FIGHTING_MAIL_TITLE = "战力榜排名奖励";
    public static final String SOUL_MAIL_TITLE = "龙魂榜排名奖励";
    public static final String WARRIOR_MAIL_TITLE = "战士榜排名奖励";
    public static final String MASTER_MAIL_TITLE = "法师榜排名奖励";
    public static final String SHAMAN_MAIL_TITLE = "萨满榜排名奖励";
    public static final String PALADIN_MAIL_TITLE = "战士榜排名奖励";

    public static final String[] EQUIP_POS_NAMES = {"武器", "头盔", "衣服", "项链", "手镯", "手镯", "戒指", "戒指"};
    public static final String[] GOD_ARTIFACT_NAMES = {"玲珑塔", "开天斧", "崆峒印", "指天剑", "东皇钟", "昆仑龙蟠", "伏羲琴鞘", "封天神印", "神农圣像", "盘古之握"};

    private static final String PLACEHOLDER = "$datetime$";
    private static final String SERVER_CLOSE_BROADCAST_MESSAGE = "[#ffff00服务器将于" + PLACEHOLDER + "关闭 届时将断开连接 请提前做好下线准备]";

    public static final String getCloseMessage(String timeStr) {
        return SERVER_CLOSE_BROADCAST_MESSAGE.replace(PLACEHOLDER, timeStr);
    }

    public static final String ACTIVITY_PAY_BROADCAST_MESSAGE = "[#ffff00今天充值，吐血返利。详情请查看公告。]";

    public static final String WORLD_BOSS_OPEN = "[#ff0000世界BOSS已出现，各位英雄速速将其制服，参与也有奖励！]";
    public static final String WORLD_BOSS_HP_80 = "[#ff0000世界BOSS的生命已被磨掉20%，继续输出不要手软！]";
    public static final String WORLD_BOSS_HP_50 = "[#ff0000世界BOSS仅剩一半的生命，再接再厉！]";
    public static final String WORLD_BOSS_HP_20 = "[#ff0000世界BOSS只有20%的生命，抓紧时间快将其灭掉！]";
    public static final String WORLD_BOSS_DEAD = "[#ff0000世界BOSS再凶猛，也挡不住团结的力量，恭喜成功将BOSS击杀，快去领奖励吧！]";
    public static final String WORLD_BOSS_END = "[#ff0000很遗憾，没有能成功将世界BOSS击杀，下次快叫上你的小伙伴一起来！]";

    public static final String GANG_BOSS_OPEN = "[#ff0000【$1】召唤的公会BOSS已出现，各位英雄速速将其制服，参与也有奖励！]";
    public static final String GANG_BOSS_HP_80 = "[#ff0000【$1】的公会BOSS的生命已被磨掉20%，继续输出不要手软！]";
    public static final String GANG_BOSS_HP_50 = "[#ff0000【$1】的公会BOSS仅剩一半的生命，再接再厉！]";
    public static final String GANG_BOSS_HP_20 = "[#ff0000【$1】的公会BOSS只有20%的生命，抓紧时间快将其灭掉！]";
    public static final String GANG_BOSS_DEAD = "[#ff0000【$1】的公会BOSS再凶猛，也挡不住团结的力量，恭喜成功将BOSS击杀，快去领奖励吧！]";
    public static final String GANG_BOSS_END = "[#ff0000很遗憾，没有能成功将【$1】的公会BOSS击杀，下次快叫上你的小伙伴一起来！]";


    /**
     * 拍卖行竞拍失败
     **/
    public static final String AUCTION_RETURN_TITLE = "竞价返还通知";
    public static final String AUCTION_RETURN_CONTENT = "您的出价被超过，全款返还。";

    public static final String AUCTION_WIN_TITLE = "竞拍胜出通知";
    public static final String AUCTION_WIN_CONTENT = "恭喜您在本次竞拍中胜出";

    public static final String AUCTION_SALE_TITLE = "拍品售出通知";
    public static final String AUCTION_SALE_CONTENT = "恭喜您的拍品已售出";

    public static final String AUCTION_LOSS_TITLE = "流拍通知";
    public static final String AUCTION_LOSS_CONTENT = "很遗憾您的竞品流拍";

    /**
     * 怪物攻城
     **/
    public static final String MONSTER_BATTLE_REWARD_TITLE = "击退怪物攻城奖励";
    public static final String MONSTER_BATTLE_REWARD_CONTENT = "恭喜！在怪物攻城中获得以下奖励，请注意查收";
}
